In [4]:
import numpy as np

In [5]:
import pandas as pd

In [6]:
file1 = pd.read_csv(r"C:\Users\iLoveyou\lab-customer-analysis-round-1\files_for_lab\csv_files\file1.csv")

In [7]:
file2 = pd.read_csv(r"C:\Users\iLoveyou\lab-customer-analysis-round-1\files_for_lab\csv_files\file2.csv")

In [8]:
file3 = pd.read_csv(r"C:\Users\iLoveyou\lab-customer-analysis-round-1\files_for_lab\csv_files\file3.csv")

In [9]:
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [10]:
file2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [11]:
file3.head()

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [12]:
file1.shape

(4008, 11)

In [13]:
file2.shape

(996, 11)

In [14]:
file3.shape

(7070, 11)

In [15]:
file1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [16]:
file2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [17]:
file2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [18]:
file3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

### Changing Column Names

In [19]:
file3 = file3.rename(columns={ 'State':'ST', 'Gender' : 'GENDER'})

In [20]:
file3.columns

Index(['Customer', 'ST', 'Customer Lifetime Value', 'Education', 'GENDER',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

file2.columns

In [21]:
file2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [23]:
colname2=file1.columns

In [24]:
##This is the code to create the data frame 
data=pd.DataFrame(columns=colname2)

In [25]:
data.head()

Empty DataFrame
Columns: [Customer, ST, GENDER, Education, Customer Lifetime Value, Income, Monthly Premium Auto, Number of Open Complaints, Policy Type, Vehicle Class, Total Claim Amount]
Index: []

In [26]:
data=pd.concat([data,file1],axis=0)

In [27]:
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [28]:
data=pd.concat([data,file2],axis=0)

In [29]:
data=pd.concat([data,file3],axis=0)

In [30]:
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [31]:
data.shape

(12074, 11)

In [32]:
#resetting the idex (refreshing the data frame)
data.reset_index(drop=True, inplace=True)

In [33]:
data.shape

(12074, 11)

### Checking and Cleaning

In [34]:
data.shape

(12074, 11)

In [35]:
##This code removes rows where there are no numners (NaN cells only)
missingdata=data.isna().all(axis=1)

In [36]:
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

#### Removing columns

In [37]:
data = data.drop(['Education'],axis=1)

In [38]:
data = data.drop(['Number of Open Complaints'],axis=1)

In [39]:
data.head()

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323

In [40]:
data.reset_index(drop=True, inplace=True)

In [41]:
data.shape

(12074, 9)

### Changing data type

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Customer                 9137 non-null   object
 1   ST                       9137 non-null   object
 2   GENDER                   9015 non-null   object
 3   Customer Lifetime Value  9130 non-null   object
 4   Income                   9137 non-null   float64
 5   Monthly Premium Auto     9137 non-null   float64
 6   Policy Type              9137 non-null   object
 7   Vehicle Class            9137 non-null   object
 8   Total Claim Amount       9137 non-null   float64
dtypes: float64(3), object(6)
memory usage: 849.1+ KB

In [46]:
#This code is doing two things. First line converts the CLV to all numeric data. The second just times it by 100
data['Customer Lifetime Value'] = pd.to_numeric(data['Customer Lifetime Value'], errors = 'coerce')
data['Customer Lifetime Value'] = data['Customer Lifetime Value'] * 100

In [45]:
#iloc is like 'integer look up' - a ways of looking up using numbers against the index. This code means. rows 1 to 200 AND columns 1 to 4
data.iloc[1:200,0:4]

    Customer          ST GENDER  Customer Lifetime Value
1    QZ44356     Arizona      F                      NaN
2    AI49188      Nevada      F                      NaN
3    WW63253  California      M                      NaN
4    GA49547  Washington      M                      NaN
5    OC83172      Oregon      F                      NaN
..       ...         ...    ...                      ...
195  YL83902          WA      F                      NaN
196  AZ62651      Oregon      M                      NaN
197  ZW25874      Oregon      M                      NaN
198  EH41854          WA      F                      NaN
199  MW70227  California      M                      NaN

[199 rows x 4 columns]

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Customer                 9137 non-null   object
 1   ST                       9137 non-null   object
 2   GENDER                   9015 non-null   object
 3   Customer Lifetime Value  7070 non-null   float64
 4   Income                   9137 non-null   float64
 5   Monthly Premium Auto     9137 non-null   float64
 6   Policy Type              9137 non-null   object
 7   Vehicle Class            9137 non-null   object
 8   Total Claim Amount       9137 non-null   float64
dtypes: float64(4), object(5)
memory usage: 849.1+ KB

### Spotting and deleting Duplicates

In [80]:
#this code gets rid of any rows that are exact duplicates (across all columns)
data = data.drop_duplicates()

There should not be two customer records across the data set. So we need to spot any and delete one of them.

In [60]:
#this code counts the number of values for each variable in the column customer
data['Customer'].value_counts()

NJ10602    2
AY18433    2
ST27958    2
GK67747    2
NJ15094    2
          ..
MQ74051    1
OX62244    1
BG76355    1
TZ47750    1
QY70905    1
Name: Customer, Length: 9056, dtype: int64

In [72]:
#this code gets rid of duplicate rows in column customer. - keeping the last entry and deleting the previous ones. 
data = data.drop_duplicates(subset=['Customer'], keep='last')

In [73]:
data['Customer'].value_counts()

FV94802    1
FM30352    1
TY59231    1
CB17191    1
BY23642    1
          ..
FX78901    1
VX43756    1
FG23952    1
CP66511    1
QY70905    1
Name: Customer, Length: 9056, dtype: int64

### deleting empty rows

In [74]:
#we can easily create a df of missing values using isna()
# QUESTION: What is this view telling me? - Looks like CLV has a lot of missing values ?

missingdata=data.isna()
missingdata.head()

,Customer,ST,GENDER,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,False,False,True,True,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False
5,False,False,False,True,False,False,False,False,False

In [77]:
data.iloc[0:200,0:4]

    Customer          ST GENDER  Customer Lifetime Value
0    RB50392  Washington    NaN                      NaN
1    QZ44356     Arizona      F                      NaN
2    AI49188      Nevada      F                      NaN
3    WW63253  California      M                      NaN
5    OC83172      Oregon      F                      NaN
..       ...         ...    ...                      ...
207  SD64087  California      M                      NaN
208  OY38576      Oregon      F                      NaN
209  BG76355          WA      F                      NaN
210  IP66913        Cali      M                      NaN
211  LE95702        Cali      M                      NaN

[200 rows x 4 columns]